# Exercise 4.5 Data Consistency Checks

### Content List
#### 01. Import Libraries & Datasets
#### Task 4.5 Answers

## 01. Import Libraries & Datasets

In [1]:
#Importing labaries
import pandas as pd
import numpy as np
import os

In [2]:
pd.options.display.float_format = '{:.4f}'.format

In [3]:
#Importing Datasets
path=r'C:\Users\Utilizador\OneDrive\Documents\CareerFoundry - Data Analyst\Data Immersion\A4\19-01-2024 Instacart Basket Analysis'

In [4]:
df_prods = pd.read_csv(os.path.join(path,'02 Data','Original Data','products.csv'),index_col=False)

In [5]:
df_ords = pd.read_csv(os.path.join(path,'02 Data','Prepared Data','orders_wrangled.csv'),index_col=False)

In [6]:
#create a dataframe
df_test = pd.DataFrame()

In [7]:
#create a mix type column
df_test['mix']=['a','b',1,True]

In [8]:
df_test

    mix
0     a
1     b
2     1
3  True

In [9]:
#check for mix data types
for col in df_test.columns.tolist():
  weird = (df_test[[col]].map(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [10]:
#check df_prods for missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [11]:
#Display the missing values in a subset dataframe
df_nan=df_prods[df_prods['product_name'].isnull()==True]

In [12]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14 12.2000
68             69          NaN        26              7 11.8000
115           116          NaN        93              3 10.8000
261           262          NaN       110             13 12.1000
525           525          NaN       109             11  1.2000
1511         1511          NaN        84             16 14.3000
1780         1780          NaN       126             11 12.3000
2240         2240          NaN        52              1 14.2000
2586         2586          NaN       104             13 12.4000
3159         3159          NaN       126             11 13.1000
3230         3230          NaN       120             16 14.4000
3736         3736          NaN        41              8 14.8000
4283         4283          NaN        77              7 14.4000
4790         4790          NaN        91             16 14.5000
38187       38183          NaN        39             12 20.9000
40444       40440          NaN       120             16 14.8000

In [13]:
#check number of rows in df_prods
df_prods.shape

(49693, 5)

In [14]:
#create new dataframe without missing values
df_prods_clean = df_prods[df_prods['product_name'].isnull()==False]

In [15]:
#check number of rows after removal of missing values
df_prods_clean.shape

(49677, 5)

In [16]:
#check for duplicates
df_dups=df_prods_clean[df_prods_clean.duplicated()]

In [17]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8000
18459,18458,Ranger IPA,27,5,9.2000
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4000
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8000
35495,35491,Adore Forever Body Wash,127,11,9.9000

In [18]:
df_prods_clean.shape

(49677, 5)

In [19]:
#create a new df to exclude duplicates
df_prods_clean_no_dups=df_prods_clean.drop_duplicates()

In [20]:
df_prods_clean_no_dups.shape

(49672, 5)

In [21]:
#export checked df to csv
df_prods_clean_no_dups.to_csv(os.path.join(path,'02 Data','Prepared Data','products_checked.csv'))

# Task 4.5 Answers

##### 2. Run the df.describe() function on your df_ords dataframe. Using your new knowledge about how to interpret the output of this function, share in a markdown cell whether anything about the data looks off or should be investigated further.

In [22]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3421083.0000,3421083.0000,3421083.0000,3421083.0000,3421083.0000,3421083.0000,3214874.0000
mean,1710541.0000,1710542.0000,102978.2081,17.1549,2.7762,13.4520,11.1148
std,987581.7398,987581.7398,59533.7178,17.7332,2.0468,4.2261,9.2067
min,0.0000,1.0000,1.0000,1.0000,0.0000,0.0000,0.0000
25%,855270.5000,855271.5000,51394.0000,5.0000,1.0000,10.0000,4.0000
50%,1710541.0000,1710542.0000,102689.0000,11.0000,3.0000,13.0000,7.0000
75%,2565811.5000,2565812.5000,154385.0000,23.0000,5.0000,16.0000,15.0000
max,3421082.0000,3421083.0000,206209.0000,100.0000,6.0000,23.0000,30.0000

-The index column was saved as an unnamed column
-The data meets my expectations and I do not need to investigate further.

##### 3.Check for mixed-type data in your df_ords dataframe.

In [23]:
#check for mix data types
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].map(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

There are no mix type columns

In [24]:
#all columns are confirmed to not be mix type
df_ords.dtypes

Unnamed: 0                  int64
order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

##### 5.Run a check for missing values in your df_ords dataframe.

In [25]:
#check for missing values
df_ords.isnull().sum()

Unnamed: 0                     0
order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [26]:
#create subset of missing values
df_ords_nan=df_ords[df_ords['days_since_prior_order'].isnull()==True]

In [27]:
df_ords_nan

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,0,2539329,1,1,2,8,NaN
11,11,2168274,2,1,2,11,NaN
26,26,1374495,3,1,1,14,NaN
39,39,3343014,4,1,6,11,NaN
45,45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,3420930,969311,206205,1,4,12,NaN
3420934,3420934,3189322,206206,1,3,18,NaN
3421002,3421002,2166133,206207,1,6,19,NaN
3421019,3421019,2227043,206208,1,1,15,NaN
3421069,3421069,3154581,206209,1,3,11,NaN

The missing values are the very fist order placed by each user_id. It is impossible to have days since prior order on the first order

##### 6. Address the missing values using an appropriate method

In [28]:
df_ords.shape

(3421083, 7)

In [29]:
#create a new variable that acts like a flag based on missing value
df_ords['is_first_order'] = df_ords['days_since_prior_order'].isnull().astype(int)

In [30]:
df_ords

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,is_first_order
0,0,2539329,1,1,2,8,NaN,1
1,1,2398795,1,2,3,7,15.0000,0
2,2,473747,1,3,3,12,21.0000,0
3,3,2254736,1,4,4,7,29.0000,0
4,4,431534,1,5,4,15,28.0000,0
...,...,...,...,...,...,...,...,...
3421078,3421078,2266710,206209,10,5,18,29.0000,0
3421079,3421079,1854736,206209,11,4,10,30.0000,0
3421080,3421080,626363,206209,12,1,12,18.0000,0
3421081,3421081,2977660,206209,13,1,12,7.0000,0
3421082,3421082,272231,206209,14,6,14,30.0000,0

I used this method of choice because replacing the missing value with any other integer would completely change the integrity of the data set. There are no days since prior order because it is the first order-

In [31]:
df_ords['is_first_order'].value_counts(dropna = False)

is_first_order
0    3214874
1     206209
Name: count, dtype: int64

##### 7.Run a check for duplicate values in your df_ords data.

In [32]:
#Check for duplicates
df_ords_dups=df_ords[df_ords.duplicated()]

In [33]:
df_ords_dups

Empty DataFrame
Columns: [Unnamed: 0, order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, is_first_order]
Index: []

No duplicates have been found

##### 9. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data” folder and give them appropriate, succinct names.

In [34]:
#exporting df_prods was done at the end of the exercise before the Task answers
#Export df_ords
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data','orders_checked.csv'))